Revit 2026 API

# ExportIFCCategoryKey Class

---

Represents a Revit category item stored in a template.

SystemObject Autodesk.Revit.DBExportIFCCategoryKey

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExportIFCCategoryKey : IDisposable
```
```vb
Public Class ExportIFCCategoryKey
	Implements IDisposable
```
```cpp
public ref class ExportIFCCategoryKey : IDisposable
```
```fsharp
type ExportIFCCategoryKey =
    class
        interface IDisposable
    end
```

The ExportIFCCategoryKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExportIFCCategoryKey | Constructs a new ExportIFCCategoryKey with default values. |
|  | ExportIFCCategoryKey(String, String, CustomSubCategoryId) | Constructs a new ExportIFCCategoryKey with category, subcategory names and special id. |

|  | Name | Description |
| --- | --- | --- |
|  | CategoryName | The Revit category name. |
|  | CustomSubCategoryId | The Revit custom subcategory id. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SubCategoryName | The Revit subcategrory name. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ExportIFCCategoryKey |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace